package err_code

type Err struct {
}

var err = map[int]string{}

func init() {
	err[-1] = "默认"
	err[1000] = "通用错误"
	err[1001] = "系统繁忙,请稍候再试"
	err[1002] = "操作频繁,请稍后再试"
	err[1003] = "错误尝试过多,请稍后再试"
	err[1004] = "验证码错误"
	err[1005] = "验证码不存在"
	err[1006] = "验证码已过期"
	err[1007] = "智能验证失败"
	err[1008] = "参数缺失"
	err[1009] = "验证码已使用"
	err[1010] = "请求参数校验不通过"
	err[1011] = "请求参数解析失败"
	err[1012] = "请求参数缺失"
	err[-1013] = "主键或唯一键约束失败"
	err[1014] = "上传文件大小超过限制"
	err[1015] = "上传文件错误"
	err[1016] = "数据验签失败"
	err[1017] = "数据解密失败"
	err[1018] = "系统繁忙,请稍候再试"
	err[1019] = "未匹配到请求URL"
	err[1020] = "登录状态异常,请重新登录后操作"

}

func (e Err) Get(code int) string {
	return err[code]
}